Revit 2027 API
StairsComponentConnection.ElementId Property
 The element Id of connected stairs component in the stairs connection.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ElementId { get; }
Public ReadOnly Property ElementId As ElementId
	Get
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
member ElementId : ElementId with get
Property Value
ElementId
See Also
Reference
StairsComponentConnection Class
Autodesk.Revit.DB.Architecture Namespace